[{"model": "catches.video", "pk": 1, "fields": {"name": "FLY TYING: BRIAN'S SIMPLE SCUD", "notes": "Brian Chan ties a simple Scud (Freshwater Shrimp) pattern and talks about the best time to fish Scuds and why they are such an important food item for Trout and other fish species.", "author": "Brian Chan", "url": "https://youtu.be/W17vIsGjQH4", "date_added": "2022-12-14", "snippet": ""}}, {"model": "catches.video", "pk": 2, "fields": {"name": "FLY TYING: BRIAN'S DLT Micro Leech", "notes": "Brian Chan ties up a very innovative Leech Pattern that imitates a variety of lake food sources, like leeches, damselfly nymphs, and even Freshwater Shrimp.", "author": "Brian Chan", "url": "https://youtu.be/SF0W3zra7_g", "date_added": "2022-12-15", "snippet": ""}}, {"model": "catches.video", "pk": 3, "fields": {"name": "Alfred's Boatman | Fish It on the Surface or Below", "notes": "This buoyant pattern can be fished at the surface when fish are actively taking boatman at or just below the surface.  You can also use a clear intermediate, Type III, or faster sink rate line to drag the fly down.  Dragging the fly down simulates the u-shaped travel path the natural boatmen take back and forth to the surface to replenish their air supply.", "author": "Phil Rowley", "url": "https://youtu.be/5KOnWcAo6IA", "date_added": "2022-12-15", "snippet": ""}}, {"model": "catches.video", "pk": 4, "fields": {"name": "FLY TYING: CHAN'S ASB WINE CHIRONOMID", "notes": "Brian Chan ties his Anti-Static Bag Wine Chironomid and explains why wine/maroon colors are so important along with talking about how various materials mimic gases trapped by chironomids as they emerge.", "author": "Phil Rowley", "url": "https://youtu.be/a4BY31uGhl4", "date_added": "2022-12-15", "snippet": ""}}, {"model": "catches.video", "pk": 5, "fields": {"name": "Stimulator Fly Tying - Randall Kaufmann Fly Pattern", "notes": "The Stimulator is an amazing fly pattern developed by fly tying legend Randall Kaufmann.  The Stimulator was originally developed to imitate a stonefly adult.  But that is not the only insect the Stimulator imitates.  The Stimulator also emulates a grasshopper, caddis or even large drake mayflies!  The Stimulator is also a great dry fly for fishing a dropper underneath.  The bushy profile and deer hair make the Stimulator a highly buoyant fly.  The Stimulator is most often tied in olive, orange, black and yellow.  Usually tied in sizes #06-16.", "author": "", "url": "https://youtu.be/fmSGdeJwmLo", "date_added": "2022-12-15", "snippet": ""}}, {"model": "catches.video", "pk": 7, "fields": {"name": "How to Fish: Dragonfly Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginners’ guide to fishing. Dragonflies are a popular food source for trout and other fish in British Columbia’s lakes. Freshwater fishing expert Brian Chan covers the dragonfly life cycle and fishing strategies for targeting trout feeding on dragonflies.", "author": "Brian Chan", "url": "https://youtu.be/M4E9JrchLxE", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 8, "fields": {"name": "How to Fish: Leech Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginners’ guide to fishing. For more information on freshwater fishing in British Columbia, Canada, visit https://www.gofishbc.com\r\n\r\nB.C. fishing icon, Brian Chan, shares some of his extensive knowledge on British Columbia’s aquatic freshwater insects and worms. Discover some of Brian's top techniques for catching fish.\r\n\r\nLeeches are a common food source for trout and other fish in British Columbia’s lakes. Learn more about leech fishing patterns, the optimal gear set-up, and retrieval techniques targeted at trout feeding on leeches.", "author": "Brian Chan", "url": "https://youtu.be/MKL17Tupn68", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 9, "fields": {"name": "How to Fish: Scud or Shrimp Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginners’ guide to fishing. Shrimp and scuds are popular food sources for trout and other fish in British Columbia’s freshwater lakes. TV personality and fishing icon, Brian Chan, covers the lifecycle of the caddisfly and fishing strategies for targeting trout feeding on the shrimp and scuds.", "author": "Brian Chan", "url": "https://youtu.be/eDvt4SjYcIA", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 11, "fields": {"name": "How to Fish: Damselfly Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginners' guide to fishing. The damselfly is a popular food source for trout and other fish in British Columbia’s lakes year-round. Freshwater fishing expert Brian Chan covers the life cycle of the damselfly and fishing strategies for targeting trout feeding on the damselfly hatch.", "author": "Brian Chan", "url": "https://youtu.be/s4TN9viUzS0", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 13, "fields": {"name": "How to Fish: Water Boatman and Backswimmer Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginners’ guide to fishing. Water boatman and backswimmers are popular year-round food sources for trout and other fish in British Columbia’s lakes. Freshwater fishing expert Brian Chan covers the life cycle of water boatman and backswimmers and fishing strategies for targeting trout feeding on them.", "author": "Brian Chan", "url": "https://youtu.be/U0o7FOjb2ug", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 14, "fields": {"name": "The Water Floatman", "notes": "A favourite water boatman pattern, especially during the fall", "author": "Phil Rowley", "url": "https://youtu.be/WgWTts6IHo0", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 15, "fields": {"name": "How to Fish: Caddisfly Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginners' guide to fishing. The caddisfly is a popular food source for trout and other fish in British Columbia’s lakes. Freshwater fishing expert Brian Chan covers the lifecycle of the caddisfly and fishing strategies for targeting trout feeding on the caddisfly hatch, which occurs each year in late June/ early July in B.C.", "author": "Brian Chan", "url": "https://youtu.be/btDyMp4OMNQ", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 16, "fields": {"name": "How to Fish: Mayfly Fly Fishing Strategies", "notes": "Learn how to catch trout in this beginner’s guide to fishing. The mayfly is a popular food source for trout and other fish in British Columbia’s lakes. In this video, freshwater fishing expert Brian Chan covers the life cycle of the mayfly and fishing strategies for targeting trout feeding on the mayfly hatch.", "author": "Brian Chan", "url": "https://youtu.be/jua9LAUx0u0", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 17, "fields": {"name": "Gold Ribbed Hares Ear", "notes": "In today’s video, Rick (The FlyFish Fanatic)™ will be tying what is probably my favorite trout river pattern, PERIOD, The Hare’s Ear. This fly has always done well for me, I tie in many different sizes and with and without a bead head. This and the Pheasant tail are definitely my goto patterns for any river that holds trout.", "author": "", "url": "https://youtu.be/OakD091Pnl0", "date_added": "2022-12-16", "snippet": ""}}, {"model": "catches.video", "pk": 18, "fields": {"name": "Elk Hair Caddis Fly Pattern", "notes": "No fly vest is complete without a caddisfly imitation, and this one is my favourite. Getting the elk-hair\r\nwing stacked properly on this fly is the greatest challenge for the tier, but when done correctly, the Elk\r\nHair Caddis is an ideal imitation for a variety of caddisfly hatches. The hackle wrapped over the body\r\nmakes the fly super-buoyant, helping it sit upright on the water. It also lets you skitter the fly across the\r\nsurface.\r\nMy most memorable day with the Elk Hair Caddis was on B.C.’s Whitetail Lake. The action had been\r\ndecent throughout the day, but it absolutely died as evening approached, despite the fact the fish were\r\nrising like crazy. As I lifted my rod tip to bring in my Elk Hair Caddis and try a new pattern, the fly\r\ndanced across the surface and a big rainbow slammed it, breaking the tippet. I quickly tied on another\r\nElk Hair, and instead of allowing it to sit motionless, I began to retrieve it. Instantly, I got another\r\nstrike. That time I landed a big rainbow. And so went the action for the next couple of hours. Since that\r\nday, I’ve used this technique often, even on flowing water, skittering the fly across the surface on a\r\ntight line at the end of the drift. Just hang on, because strikes are explosive.", "author": "", "url": "https://youtu.be/M7HzcSP4jlM", "date_added": "2022-12-17", "snippet": ""}}, {"model": "catches.video", "pk": 20, "fields": {"name": "Pumpkin Snatcher", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/QvJB3kRc1fc", "date_added": "2022-12-29", "snippet": ""}}, {"model": "catches.video", "pk": 21, "fields": {"name": "Adventure #37 2022 | Cow Lake, Alberta | Ice Fishing, Fiesta Bowl Lunch Review and Dad Joke", "notes": "", "author": "Matt (My Day Off)", "url": "https://youtu.be/WA6NjreT-tQ", "date_added": "2022-12-29", "snippet": ""}}, {"model": "catches.video", "pk": 22, "fields": {"name": "Adventure # 36 2022 | Twin Lakes, Alberta | Rainbow Trout and Perch | Extra Underwater Footage", "notes": "", "author": "Matt (My Day Off)", "url": "https://youtu.be/dySbs5d8m4s", "date_added": "2022-12-29", "snippet": "Hi everyone, this week I wanted to try ice fishing Twin Lakes, Alberta. There are rainbow trout and perch in the lake and I have my underwater camera fully charged. Thanks for watching, have a great day!"}}, {"model": "catches.video", "pk": 23, "fields": {"name": "Ruby Eyed Leech", "notes": "Designed by Brian Chan, the Ruby Eyed Leech is a deadly leech pattern.  No stillwater fly box would be complete without a few Ruby Eyed Leeches in a variety of colors.  This black and red version has performed particularly well.  Not surprisingly, this one of our top selling leech patterns on our Stillwater Fly Fishing Store (www.stillwaterflyfishingstore.com)", "author": "Brian Chan", "url": "https://youtu.be/8BtIlCeGvN4", "date_added": "2022-12-30", "snippet": "Designed by Brian Chan, the Ruby Eyed Leech is a deadly leech pattern."}}, {"model": "catches.video", "pk": 24, "fields": {"name": "Adventure #25 2022 | Nordegg Borrow Pit West", "notes": "", "author": "Matt (My Day Off)", "url": "https://youtu.be/0aONbKqZZh4", "date_added": "2023-01-18", "snippet": "Trout, Underwater Footage and Smoked Shotgun Shells"}}, {"model": "catches.video", "pk": 25, "fields": {"name": "EVERY FLY FISHER SHOULD HAVE | HOW TO TIE A MIDGE | PUPA EMERGER & FLY", "notes": "Big bad articulated streamers are a ton of fun when the browns are on the hunt.. Watching any size trout suck down your massive foam dry fly can be enough to drive a man insane.. A tiny rock dwelling worm is not glamourous.. and is certainly not flashy.. But every angler needs to have a Midge or two in your box!\r\nThese are my three favorite Midge patterns to represent the three major stages in this little bugs lifecycle. Tying the midge pupa, midge emerger, and midge fly are all fairly simple and extremely effective.  These are my go to patterns for winter time fishing or if I were to stumble upon a cheeky tailwater.", "author": "", "url": "https://youtu.be/ubCxcAkkcgA", "date_added": "2023-03-04", "snippet": "Tying the midge lifecycle"}}, {"model": "catches.video", "pk": 26, "fields": {"name": "Lake Talk Live-Water Boatman and Backsimmers", "notes": "Fall is at our doorsteps.  This means water boatmen and backswimmers will soon be taking flight to mate and migrate.  When these air-breathing insects return to the water they drive trout crazy initiating a concentrated feeding frenzy.\r\n\r\nWatch as Brian Chan and I  talk about water boatmen and backswimmers. Learn about these unique aquatic insects along with our favorite patterns, presentation techniques, and on-the-water strategies.  At the end of this talk, I tie a couple of our favorite patterns.", "author": "Phil Rowley", "url": "https://www.youtube.com/live/riTE_G1KnQU?feature=share", "date_added": "2023-03-04", "snippet": ""}}, {"model": "catches.video", "pk": 27, "fields": {"name": "BCFlyguys Quick Tips E05 - Fall Leeching", "notes": "", "author": "BCFlyguys", "url": "https://youtu.be/Sknf_UQQ9q8", "date_added": "2023-03-04", "snippet": ""}}, {"model": "catches.video", "pk": 30, "fields": {"name": "Fly Tying Tutorial Video- The All CDC Damsel", "notes": "", "author": "", "url": "https://youtu.be/F3fOBvBHQ6w", "date_added": "2023-03-04", "snippet": ""}}, {"model": "catches.video", "pk": 31, "fields": {"name": "How to Tie the Apps Worm-Attractor or Imitator?", "notes": "How to tie the Apps Worm. Originally designed as a bloodworm (Chironomid larva) pattern Peter Applebly's Apps Worm has fast become one of my favorite stillwater fly patterns.  \r\n\r\nFellow stillwater fanatic Rhys from Rhys's Fishes convinced me to give this fly a try a few years ago, and I have never looked back.  Check out the links below to Rhys's channel and his Apps Worms Tying videos.\r\n\r\nYou can fish this fly under an indicator, retrieve it slowly using cast and retrieve techniques or strip it fast to trigger a reaction.  A superb fly that belongs in every stillwater fly box.\r\n\r\nApps Worm\r\nHook: Daiichi 1530 #10-#14\r\nThread: Glo Brite Floss\r\nTail:  Sexi-Floss, Stretch Floss or Spanflex\r\nBody: Glo Brite Floss\r\nLegs: Sexi-Floss, Stretch Floss or Spanflex\r\nAntenna: Sexi-Floss, Stretch Floss or Spanflex", "author": "Phil Rowley", "url": "https://youtu.be/yOcM2lXHrWc", "date_added": "2023-03-04", "snippet": ""}}, {"model": "catches.video", "pk": 32, "fields": {"name": "Foam Minnow", "notes": "The Foam Minnow works well when presented in the shallows.  Its buoyant inner core keeps the fly up near the surface keeping it relatively free of snags and debris and most importantly in the view of minnow focused trout.  This pattern was also my featured pattern in the Jan/Feb 2014 issue of BC Outdoors Sport Fishing Magazine.", "author": "Phil Rowley", "url": "https://youtu.be/rMFk6ySACnM", "date_added": "2023-03-04", "snippet": ""}}, {"model": "catches.video", "pk": 33, "fields": {"name": "Brian Chan Maribou Micro Leech", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/xj5aqTDW6wI", "date_added": "2023-03-05", "snippet": "Brian Chan Maribou Micro Leech"}}, {"model": "catches.video", "pk": 34, "fields": {"name": "When and Why you use Micro Leeches", "notes": "Like any fly, it's important to know when to use them. Brian Chan of the Freshwater Fisheries Society of BC explains all you need to know about Micro Leeches in this \"Learning with the Pros\" tip from BC Outdoors Sport Fishing,", "author": "Brian Chan", "url": "https://youtu.be/C4bmV8ZGkQE", "date_added": "2023-03-05", "snippet": "it's important to know when to use them."}}, {"model": "catches.video", "pk": 35, "fields": {"name": "Balanced Leech-Bruised", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/S_6sn7ooL80", "date_added": "2023-03-05", "snippet": ""}}, {"model": "catches.video", "pk": 36, "fields": {"name": "FLY FISHING: HOW TO USE BALANCED LEECHES - BRIAN CHAN & DON FRESCHI", "notes": "Don Freschi and Brian Chan use 'balance leeches' to catch Rainbow Trout and show what equipment & flies you need to have success.", "author": "Brian Chan", "url": "https://youtu.be/VgKItXqQcg8", "date_added": "2023-03-05", "snippet": "Don Freschi and Brian Chan use 'balance leeches' to catch Rainbow Trout and show what equipment & flies you need to have success."}}, {"model": "catches.video", "pk": 37, "fields": {"name": "Chironomid Fishing in Shallow Water for BIG Trout!", "notes": "", "author": "Fly Fish University", "url": "https://youtu.be/9bwNxGTymDg", "date_added": "2023-03-07", "snippet": "Searching shallow water with chironomids in the early spring months of the stillwater fly fishing season!"}}, {"model": "catches.video", "pk": 38, "fields": {"name": "Chironomid Leader Setup (in 3 minutes...)", "notes": "", "author": "Fly Fish University", "url": "https://youtu.be/i5CsgKrhWlo", "date_added": "2023-03-07", "snippet": "A SUPER simple level leader setup for chironomid fishing on stillwaters!"}}, {"model": "catches.video", "pk": 39, "fields": {"name": "FLY FISHING: HOW TO USE MAYFLY NYMPHS", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/2t5B0CCGyQg", "date_added": "2023-03-07", "snippet": "Don and Brian Chan explain the importance of having Mayfly Nymph patterns in your fly box when fishing lakes."}}, {"model": "catches.video", "pk": 40, "fields": {"name": "Slush Jelly Blob | Trout Candy!", "notes": "Slush Jelly or Slush Blob\r\nHook:  Daiichi 1120 (#10-#12) (https://www.canadianllama.com/daiichi...)\r\nThread:  UTC 70, Color to Compliment Body (https://bit.ly/335bgDc)\r\nTail:  Krinkle Mirror Flash (https://bit.ly/3n2WVz4)\r\nBody:  Slush Jelly, Color to Match Zoo Plankton (https://www.canadianllama.com/fritz/s...)\r\nBead:  Gold, Brass (https://www.canadianllama.com/brass-b...) or Tungsten (https://www.canadianllama.com/tungste...)\r\n\r\nA favorite attractor fly of mine when trout are feeding on zooplankton.  You can suspend this pattern beneath a strike indicator when trout are suspended in deep water.  Or fish it aggressively using a brisk 4-6-inch strip pause retrieve using a sinking line.  This pattern can also be used to attract or draw fish into other, perhaps more natural, patterns when using multiple flies.\r\n\r\nIf you want to learn more about how to fly fish lakes please download and subscribe to mine and Brian Chan’s Stillwater Fly Fishing App by selecting the appropriate link below. Our app includes specific tips on how we fish attractors including indicator tactics.\r\n\r\nOne of the app benefits is the ability to take our helpful content with you wherever you go. Once downloaded to your smartphone, Wi-Fi is not needed to access the over 100 video tips, and growing, contained across five different chapters, Entomology, Leaders & Knots, Strategies and Tactics, Equipment, and Stillwater Flies.", "author": "Phil Rowley", "url": "https://youtu.be/Y7Ew2WSfcjk", "date_added": "2023-03-07", "snippet": "A favorite attractor fly of mine when trout are feeding on zooplankton."}}, {"model": "catches.video", "pk": 41, "fields": {"name": "Modified Zucchini Chironomid Pupa Fly", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/DfN-yKeK6vI", "date_added": "2023-03-07", "snippet": "Hard to improve on our time tested & proven Zucchini chironomid pupa fly pattern, but we did think it would be an interesting take to put a bit of a classic buzzer spin to it! Whip some up and see what you think ... :)"}}, {"model": "catches.video", "pk": 42, "fields": {"name": "The Black Olive Chironomid", "notes": "If you take a close look at a lot of the “black” chironomids in your samples you’ll quickly notice they will often actually be a very dark olive colour. This pattern will work when fish are on those or just the usual olive colours you see. Twist it up and have em for the spring and up your cronie game!", "author": "Phil Rowley", "url": "https://youtu.be/xGrXfx-FZxA", "date_added": "2023-03-08", "snippet": ""}}, {"model": "catches.video", "pk": 43, "fields": {"name": "This fly should be banned. Dave Hise Simple Grub Fly Pattern.", "notes": "Fly tying tutorial of a Simple Grub Pattern. Most fish species in freshwater eat grubs so it's always a good idea to have a few grubby patterns in your fly box.", "author": "", "url": "https://youtu.be/WLji2wPnSao", "date_added": "2023-03-09", "snippet": "Grub Fly Pattern"}}, {"model": "catches.video", "pk": 44, "fields": {"name": "Fly Tying: The Most DURABLE Squirmy Worm EVER! - Plus Bonus KOKANEE Footage", "notes": "In this video, I show you how to tie my version of the squirmy worm. If you've ever fished this fly, I bet you caught fish. If you didn't, I would encourage to try it again! Watch until the end to see this fly put a hurtin' on some Kokanee.", "author": "", "url": "https://youtu.be/eHP_os-5354", "date_added": "2023-03-09", "snippet": "I show you how to tie my version of the squirmy worm"}}, {"model": "catches.video", "pk": 45, "fields": {"name": "Basics of Stillwater Fly Fishing for Trout", "notes": "In this exciting episode we talk about the essentials of catching trout on lakes and ponds. Noted stillwater angler & author Phil Rowley hosts this fascinating episode that breaks down all the basics of lake fishing such as seasons, forage and rigging options. \r\nTo learn about fly fishing, check out the Orvis Learning Centre here: https://howtoflyfish.orvis.com\r\nYou can download this full-length episode here: https://vimeo.com/ondemand/133225/", "author": "Phil Rowley", "url": "https://youtu.be/GiYKggRHs70", "date_added": "2023-03-09", "snippet": "essentials of catching trout on lakes and ponds"}}, {"model": "catches.video", "pk": 46, "fields": {"name": "Simple is AWESOME // Beginner Friendly Single Nymph Rig", "notes": "", "author": "", "url": "https://youtu.be/goPFlXTtTow", "date_added": "2023-03-09", "snippet": "Make it simple"}}, {"model": "catches.video", "pk": 47, "fields": {"name": "Orvis Advanced Stillwater Tactics", "notes": "Tom Rosenbauer joins stillwater expert Phil Rowley to discuss advanced tactics for catching trout on lakes. From important details on boat positioning to understanding uses of different fly lines, this 50 minute video is full of critical information for any angler who wants to improve their stillwater game for trout! To learn how to tie some of the patterns Phil uses, go to:   \r\n\r\n / flycraftangling  \r\nTo learn about Drift Lodge & Fly Shop operated by Mike Wilson and located only 17 miles from West Yellowstone: http://www.driftlodge.com or give them a call at (208) 558-0152", "author": "Phil Rowley", "url": "https://youtu.be/LXxLEaki9U8", "date_added": "2023-03-09", "snippet": "Phil Rowley to discuss advanced tactics for catching trout on lakes"}}, {"model": "catches.video", "pk": 48, "fields": {"name": "Trout Fishing - Boatman & Backswimmer Tactics | Alberta", "notes": "The New Fly Fisher’s Stillwater expert Phil Rowley fishes Muir Lake.  A quality rainbow fishery located a mere 35 minutes from downtown Edmonton.  Phil is joined by Mike Monteith from Edmonton Stillwater Adventures.  Together they provide you with everything you need to know about imitating water boatmen and backswimmers during their annual fall mating and migration flights, including equipment, flies and tactics.\r\nGo to: http://albertastillwaters.com\r\nwww.thenewflyfisher.com", "author": "Phil Rowley", "url": "https://youtu.be/jX2PjLp9yKc", "date_added": "2023-03-09", "snippet": ""}}, {"model": "catches.video", "pk": 49, "fields": {"name": "Fly Fishing: Scud Deep Water", "notes": "Ventured out to the area above the dock.... yes in the main lake where not many people have thought to fly fish using a scud fished deep on the bottom.  I'm experimenting and taking you along.", "author": "", "url": "https://youtu.be/p2b0pavh-aE", "date_added": "2023-03-09", "snippet": ""}}, {"model": "catches.video", "pk": 50, "fields": {"name": "Phil Rowley on Fishing A New Lake | Medicine Hat Alberta", "notes": "In this educational episode, stillwater guru Phil Rowley travels to Bullshead Reservoir outside of Medicine Hat to fly fish for rainbow trout. Phil discusses proper presentation techniques, food sources and much more!\r\nwww.thenewflyfisher.com", "author": "Phil Rowley", "url": "https://youtu.be/sYhumUOD4M8", "date_added": "2023-03-09", "snippet": "Phil discusses proper presentation techniques, food sources and much more!"}}, {"model": "catches.video", "pk": 51, "fields": {"name": "Lake Turnover 101 with Brian Chan", "notes": "Ever wonder what happens after a winter thaw to the plants, oxygen and of course the fish in the lake? Brian Chan discusses the biology of turnover on a lake. This is the \"Learning with the Pros\" tip from Roche Lake from our Season 2 Premiere episode of BC Outdoors Sport Fishing.\r\n\r\nHappens in all small lakes.\r\nJust after ice off, the surface O2 rich water is colder and the bottom O2 poor water is warmer.  The warmth is caused by decomposing veg.\r\nFour to seven days after ice off and on a windy day, the layers reverse and then mix.  This spreads the O2 all throughout the water column.  This means that there is not much O2 for fish or bugs and the catch comes right off.  As well the water gets very murky.  \r\nOnce the turnover happens, the O2 comes up across the lake and the hatches start.  The lake will clear up as well.", "author": "Brian Chan", "url": "https://youtu.be/fLTMuQo4h-4", "date_added": "2023-03-09", "snippet": "Brian Chan discusses the biology of turnover on a lake"}}, {"model": "catches.video", "pk": 52, "fields": {"name": "GIANT FALL TROUT | HOW TO WITH BRIAN CHAN", "notes": "If you want to catch massive trout in the fall, then you have to watch this very special video with stillwater guru Brian Chan. Host Colin McKeown joins Brian near Kamloops British Columbia to fly fish for big trout and learn some outstanding techinques for success. Must watch video for those that love to fish for trout on lakes. For More Videos: https://goo.gl/F5CLCq\r\nSubscribe to Learn More About Fly Fishing: https://goo.gl/gQcSNw\r\nwww.thenewflyfisher.com", "author": "Brian Chan", "url": "https://youtu.be/xShD6BU5zAw", "date_added": "2023-03-09", "snippet": "fish for big trout and learn some outstanding techinques for success"}}, {"model": "catches.video", "pk": 53, "fields": {"name": "FLY FISHING: FALL SEASON TECHNIQUES WITH BRIAN CHAN - SFOTF CLASSIC", "notes": "Brian Chan and Grant Fines talk about the various techniques and flies to use in the Fall Season on BC Stillwaters. This is a SFOTF Classic but still contains valuable information.", "author": "Brian Chan", "url": "https://youtu.be/WN_myDaSnQY", "date_added": "2023-03-09", "snippet": "talk about the various techniques and flies to use in the Fall Season"}}, {"model": "catches.video", "pk": 54, "fields": {"name": "Stillwater Fall Trout", "notes": "All anglers love the fall, and it's one of the best times to fish. In this video Stillwater expert, Phil Rowley visits Whiteswan Lake Lodge in Northern Saskatchewan and talks about techniques, equipment, and of course, big fish. Visit:https://whiteswanlakeresort.ca/", "author": "Phil Rowley", "url": "https://youtu.be/ifMGjwsfoz8", "date_added": "2023-03-09", "snippet": "All anglers love the fall, and it's one of the best times to fish."}}, {"model": "catches.video", "pk": 55, "fields": {"name": "How To Fish Attractor Patterns in a Lake - RIO Products", "notes": "In this episode of RIO's \"How To\" series, RIO ambassador Phil Rowley talks about how to fish attractor patterns in a lake using sinking lines. Attractor patterns (called \"lures\" in Europe) are flies that irritate and annoy trout; triggering bites from non-feeding fish. There are plenty of times an angler will get to a stillwater and find fish are not visually, or obviously, feeding, and on days like this, knowing how to fish such attractor flies can turn a bad trip into a very successful day on the water.\r\n\r\nPhil talks about why and when you would fish attractor patterns, which retrieves to work with, what gear to use and explains about key fishing tactics like “Fishing The Hang” and “The Washing Line” – two deadly lake fishing techniques. \r\n\r\nIf you are fly fish lakes for trout and want to increase your catch rates when fish are not feeding this video is a perfect lesson for you.", "author": "Phil Rowley", "url": "https://youtu.be/xTuN1AHuCsQ", "date_added": "2023-03-09", "snippet": "knowing how to fish such attractor flies can turn a bad trip into a very successful day on the water."}}, {"model": "catches.video", "pk": 56, "fields": {"name": "Streamers for Trout | How To Use Them", "notes": "Streamer fishing is visually exciting and one of the best ways to hunt for trophy trout. In this full episode host Tom Rosenbauer explains in great detail all the fundamentals you need to know. This video includes: understanding why trout eat batifish, what streamers to choose and why, flylines choices and much more! Subscribe to get all our video uploads: https://goo.gl/F82SBx\r\nTo learn more about fly fishing, check out the Orvis Learning Centre here: https://howtoflyfish.orvis.com", "author": "", "url": "https://youtu.be/J6Mg2__NK3o", "date_added": "2023-03-09", "snippet": "understanding why trout eat batifish, what streamers to choose and why"}}, {"model": "catches.video", "pk": 57, "fields": {"name": "How to Catch Rainbow Trout in Tough Conditions | Brian Chan", "notes": "Stillwater guru Brian Chan is joined by author Ron Cordes on Roche Lake in British Columbia to fly fish for rainbow trout. Conditions are horrible but Brian and Ron use their considerable skills to make things happen!  This video is full of great info that will help you to be a more successful angler.", "author": "Brian Chan", "url": "https://youtu.be/pWonzONDpWE", "date_added": "2023-03-09", "snippet": "fly fish for rainbow trout. Conditions are horrible"}}, {"model": "catches.video", "pk": 58, "fields": {"name": "How to Fish: Brian Chan’s Tackle Box Essentials | GoFishBC", "notes": "How to Fish: Brian Chan’s Tackle Box Essentials highlights the must-have equipment for a fishing tackle box. For more information on freshwater fishing in British Columbia, Canada, visit https://www.gofishbc.com\r\n\r\nBrian has been fishing B.C.’s waters for over 35 years and is a known authority on all things fly fishing. Fish clippers, haemostats, sunglasses, sunblock, hat, thermostat, fly box, throat pump, spare lines and spools are among the tackle box items discussed.", "author": "Brian Chan", "url": "https://youtu.be/hpB5swgXLdA", "date_added": "2023-03-09", "snippet": "Brian Chan’s Tackle Box Essentials highlights the must-have equipment for a fishing tackle box."}}, {"model": "catches.video", "pk": 59, "fields": {"name": "HOW TO USE FISH FINDERS EFFECTIVELY | SFOTF Tips with Brian Chan", "notes": "Fly Fishing Tips with Biologist and Fly Fisherman Brian Chan.\r\n\r\nThis episode features how to effectively use fish finders to catch more fish", "author": "Brian Chan", "url": "https://youtu.be/Sgyvo4rW6bE", "date_added": "2023-03-09", "snippet": "how to effectively use fish finders to catch more fish"}}, {"model": "catches.video", "pk": 60, "fields": {"name": "How to Fish: Chironomid Fly Fishing Strategies | GoFishBC", "notes": "Learn how to catch trout in this beginners’ guide to fishing. Chironomids (or lake flies) are a popular food source for trout and other fish in British Columbia’s lakes. Freshwater fishing expert Brian Chan covers the life cycle of the chironomid and fishing strategies for targeting trout feeding on the chironomid hatch.\r\n\r\nFor more information on freshwater fishing in British Columbia, Canada, visit https://www.gofishbc.com\r\n\r\nBrian shows examples of chironomid fly patterns, the optimal gear set-up, and retrieval techniques. The angler's goal is to imitate the behaviour of the hatching chironomid so that trout will snap up the fly.\r\n\r\nThis video is part of the How to Fish video series by GoFishBC. Watch the series to learn more about fly fishing techniques, gear selection, and the best times of year to go fishing.", "author": "Brian Chan", "url": "https://youtu.be/cXSEyvkqORQ", "date_added": "2023-03-09", "snippet": "Brian Chan covers the life cycle of the chironomid and fishing strategies for targeting trout feeding on the chironomid hatch"}}, {"model": "catches.video", "pk": 61, "fields": {"name": "Hatches - Understanding Caddis, Mayfly, Midge & Stonefly Hatches", "notes": "This fascinating video explores the details of insect hatches and their importance to trout as a source of food. The four key hatches Tom Rosenbauer discusses are: Mayflies, Midge, Caddis and Stoneflies. Choosing the right fly, leader setups, presentation techniques and much more are covered by this educational video.It also includes incredibly detailed animations, underwater video and simple-to-understand information. This video is a must-watch for any fly fisher!", "author": "", "url": "https://youtu.be/qMCM7ulfTLk", "date_added": "2023-03-09", "snippet": "details of insect hatches and their importance to trout as a source of food"}}, {"model": "catches.video", "pk": 62, "fields": {"name": "Trout Lakes & Dragons: Part 2, The Countdown Method with Skip Morris", "notes": "Internationally known fly fishing author and speaker Skip Morris teaches you how to use the countdown method in lakes when fly fishing for trout. Filmed on  beautiful Red Hills Lake, in Dayton, Oregon (www.redhillslake.com).", "author": "", "url": "https://youtu.be/onp2YPYItu0", "date_added": "2023-03-09", "snippet": "countdown method in lakes when fly fishing for trout."}}, {"model": "catches.video", "pk": 63, "fields": {"name": "How to Fly Fish Stillwaters in Summer for Trout - Flies and Rigs Explained!", "notes": "In this episode we go for a full days fishing from dawn to dusk. Adopting everything we've learnt in the tutorials so far, we start exploring how to fly fish stillwaters in summer for trout. We explain the flies and the rigs you should set your cast up as to get the most success you possibly can. Adopt these tactics. Perfect these rigs and you'll enjoy a lot of fly fishing success throughout Summer.", "author": "", "url": "https://youtu.be/VFg-i2M3wMU", "date_added": "2023-03-09", "snippet": "go for a full days fishing from dawn to dusk."}}, {"model": "catches.video", "pk": 64, "fields": {"name": "Lake Fishing for Trout Part One with Brian Chan", "notes": "Excellent video that discusses some of the essentials of catching trout in lakes, hosted by stillwater guru Brian Chan. This video was produced in 2003 in the Kamloops region of British Columbia. \r\nTo tie the Zebra Midge:   \r\n\r\n • Zebra Midge", "author": "Brian Chan", "url": "https://youtu.be/SeI1LCzVyz4", "date_added": "2023-03-09", "snippet": "essentials of catching trout in lakes,"}}, {"model": "catches.video", "pk": 65, "fields": {"name": "KNOTS", "notes": "Improved Clinch\r\n    use with drys\r\n    Having the tag end held, keeps the knot from slipping.\r\n\r\nNon-slip mono-loop or Perfection loop\r\n    Non-Slip Loop Knot Tutorial - https://youtu.be/Us0wL8KS4ww\r\n    Used when we want to hang vertically or be able to swim.\r\n     Good to make a loop for the fly line\r\n     A short film showing how to tie the perfect Non Slip Loop Knot - https://youtu.be/dmN8TZqvgWk\r\n     BEST KNOT Non-Slip Mono Loop - https://youtu.be/v27hXOQCkrc\r\n\r\n\r\nDouble/Triple Sergeons \r\n    It is fast\r\n    Thinner use triple and larger use double\r\n\r\nBlood knot\r\n    Blood Knot: Tutorial - https://youtu.be/IB3_rePvDMU\r\n    can tie in the middle of a line.\r\n\r\nNail Knot\r\n    Used to attach leader to fly line and fly line to backing.\r\n\r\n    Dropper knots\r\n      - How To Tie Droppers and Knots - RIO Products - https://youtu.be/oAbz4AFxHLI", "author": "", "url": "https://youtu.be/9b2YWAlv5-U", "date_added": "2023-03-10", "snippet": "6 Fly Fishing Knots You NEED to Know (and how to tie them...)"}}, {"model": "catches.video", "pk": 67, "fields": {"name": "How To Fish Attractor Patterns in a Lake", "notes": "In this episode of RIO's \"How To\" series, RIO ambassador Phil Rowley talks about how to fish attractor patterns in a lake using sinking lines. Attractor patterns (called \"lures\" in Europe) are flies that irritate and annoy trout; triggering bites from non-feeding fish. There are plenty of times an angler will get to a stillwater and find fish are not visually, or obviously, feeding, and on days like this, knowing how to fish such attractor flies can turn a bad trip into a very successful day on the water.\r\n\r\nPhil talks about why and when you would fish attractor patterns, which retrieves to work with, what gear to use and explains about key fishing tactics like “Fishing The Hang” and “The Washing Line” – two deadly lake fishing techniques. \r\n\r\nIf you are fly fish lakes for trout and want to increase your catch rates when fish are not feeding this video is a perfect lesson for you.", "author": "Phil Rowley", "url": "https://youtu.be/HPgruxF_Llw", "date_added": "2023-03-10", "snippet": ""}}, {"model": "catches.video", "pk": 68, "fields": {"name": "How to Fish a BLOB Fly for Trout!", "notes": "If you've ever wondered why Blob patterns are so effective in stillwaters, and exactly how to fish them, then this episode is for you!", "author": "Jordan Oelrich", "url": "https://youtu.be/VmMwkmlaWHw", "date_added": "2023-03-10", "snippet": "Blob patterns are so effective in stillwaters"}}, {"model": "catches.video", "pk": 69, "fields": {"name": "Fishing the Balanced Leech", "notes": "", "author": "", "url": "https://youtu.be/hpzYZSDyHdg", "date_added": "2023-03-10", "snippet": "One technique for fishing balanced leeches to control depth."}}, {"model": "catches.video", "pk": 70, "fields": {"name": "FLY FISHING: HOW TO FLY FISH SHALLOW WATER CHIRONOMIDS", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/frOvGIYJzIs", "date_added": "2023-03-11", "snippet": "Brian Chan and Don Freschi show to viewer how to effectively fly fish for Rainbow trout using Shallow Water Chironomid Techniques. Don ties his Pale Olive Chironomid on the bench."}}, {"model": "catches.video", "pk": 72, "fields": {"name": "FLY FISHING: SPRING CHIRONOMIDS WITH DON FRESCHI", "notes": "", "author": "", "url": "https://youtu.be/FDrTEdwkp2M", "date_added": "2023-03-11", "snippet": "Don fishes a small lake in the Kootenay Region of BC and explains some useful tips when Spring Chironomid Fly Fishing. Don shows the viewer his favorite setup, technique, and flies that he uses to successful fish chironomids in the Spring."}}, {"model": "catches.video", "pk": 73, "fields": {"name": "Retrieves When Using Indicators & Balanced Leeches", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/FlckT3AJ02I", "date_added": "2023-03-13", "snippet": "Phil Rowley is fishing on Henry's Lake in Idaho and discusses the retrieves to use when casting indicators with balanced leech flies."}}, {"model": "catches.video", "pk": 74, "fields": {"name": "Reaper Midge Fly Tying Tutorial | The Fly Fiend.", "notes": "", "author": "", "url": "https://youtu.be/o8ltXfQ05P4", "date_added": "2023-03-13", "snippet": ""}}, {"model": "catches.video", "pk": 75, "fields": {"name": "FLY FISHING TECHNIQUES FOR SMALL LAKES", "notes": "", "author": "", "url": "https://youtu.be/CtDZRVgE9Zw", "date_added": "2023-03-13", "snippet": "Don shows the viewers how to fly fish Dewolfe Lake successfully and also shows how easy it is to fly fish from a Frog Boat. Don ties his Tricked Out Chromie Chironomid on the bench."}}, {"model": "catches.video", "pk": 76, "fields": {"name": "FLY FISHING: HOW TO USE CHIRONOMIDS SUCCESSFULLY", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/88dJqGkrFPA", "date_added": "2023-03-13", "snippet": "Don and Brian Chan show the viewers the correct setup and technique to use Chironomids successfully on a lake."}}, {"model": "catches.video", "pk": 77, "fields": {"name": "FLY FISHING: STUMP LAKE BLOBS SHOW", "notes": "Don, Dale and Brian Chan fly fish Stump Lake near Kamloops, BC. Its late Fall and the fish are looking for any food items they can eat before winter sets in, which makes for some excellent Blob and Leech fishing. Don ties his Purple Micro Jig Leech on the bench.", "author": "Brian Chan", "url": "https://youtu.be/zRnWMZ-6gG8", "date_added": "2023-03-14", "snippet": "Its late Fall and the fish are looking for any food items they can eat before winter sets in,"}}, {"model": "catches.video", "pk": 78, "fields": {"name": "Why is this Chironomid Fly Pattern So Versatile? | Two-Toner BC Chironomid | Fly Tying Tutorial", "notes": "In this fly tying tutorial, Curtis ties the Two Toner BC Chironomid. \r\nThe Two Toner Chironomid fly pattern is a great stillwater fly pattern that incorporates the ability to imitate a lot of different colors of a chironomid. See how we handle the two tones.", "author": "", "url": "https://youtu.be/4ReRIcQ2Fz4", "date_added": "2023-03-14", "snippet": "In this fly tying tutorial, Curtis ties the Two Toner BC Chironomid."}}, {"model": "catches.video", "pk": 79, "fields": {"name": "Early Spring Chironomid Fly Tying Tutorial | The Fly Fiend.", "notes": "Hook - Partridge Patriot Sz12.\r\nBead - 1/8 White Pearl.\r\nBody - Two Strands Of Krystal Flash.\r\nRib - UTC Ultra Wire Sz Small.\r\nLightly Coated With Loon Outdoors Fluorescing Flow.", "author": "", "url": "https://youtu.be/bGSSgbP-YG0", "date_added": "2023-03-14", "snippet": ""}}, {"model": "catches.video", "pk": 80, "fields": {"name": "How Often Should You Change Flies?", "notes": "", "author": "Jordan Oelrich", "url": "https://youtu.be/c1ohPzVJ9wI", "date_added": "2023-03-14", "snippet": "This video is all about changing your fly, and how often you should (or shouldn't) be switching patterns!"}}, {"model": "catches.video", "pk": 81, "fields": {"name": "BEGINNER FLY FISHING: CHIRONOMID TECHNIQUES (FULL LENGTH VIDEO)", "notes": "", "author": "", "url": "https://youtu.be/SW02c4qgHb0", "date_added": "2023-03-14", "snippet": "Everything you want to know about Chironomids and how to fish them. Its an older video but full of valuable information."}}, {"model": "catches.video", "pk": 82, "fields": {"name": "FLY FISHING: HOW TO USE THE 'NAKED CHIRONOMID' TECHNIQUE", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/RxT1VRBJVVM", "date_added": "2023-03-14", "snippet": "Don and Brian Chan show the viewer how to fly fish chironomids using the 'naked' technique."}}, {"model": "catches.video", "pk": 83, "fields": {"name": "How to Chironomid Fish Without an Indicator", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/LoYVwPxaZUw", "date_added": "2023-03-16", "snippet": ""}}, {"model": "catches.video", "pk": 84, "fields": {"name": "Dangling Technique for Fly Fishing", "notes": "Michael Gould \"Ug\" of 2Salt Travel describes the dangling technique for fly fishing on lakes and reservoirs. An effective way to fly fish with stillwater nymphs and leeches when trout hold very deep. Visit 2SaltTravel.com to connect with fly fishing lodges and outfitters around the globe.", "author": "", "url": "https://youtu.be/M46i5ZkjaoE", "date_added": "2023-03-16", "snippet": "An effective way to fly fish with stillwater nymphs and leeches when trout hold very deep."}}, {"model": "catches.video", "pk": 85, "fields": {"name": "Pike on a Fly | North Saskatchewan River Fly Fishing", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/Cpvrc4w7w8Y", "date_added": "2023-03-17", "snippet": "Phil Rowley travels down the North Saskatchewan River fly fishing for big pike and walleye."}}, {"model": "catches.video", "pk": 86, "fields": {"name": "How to fish for Tiger Trout", "notes": "Tigers were first stocked in Alberta 2015 into three lakes Chain Lakes was one along with Black Nugget and East Twin (Manning). Since then the list of Tiger Trout lakes has grown.\r\nIn 2020 AEP will be stocking 29 lakes with Tiger Trout. Some Tiger trout lakes Like Chain are now stocked alternate years so it would be safe to say that the list of lakes in Alberta is 30 that are stocked with Tiger Trout. In this video, Gary Hanke discusses his approach to fishing for these aggressive fish, and how he has come to appreciate multi-species lakes. I hope you will enjoy this offering.", "author": "Let's Go Outdoors", "url": "https://youtu.be/kZMXgXliiM8", "date_added": "2023-03-17", "snippet": ""}}, {"model": "catches.video", "pk": 87, "fields": {"name": "Lake Talk Live-Understanding the Fall Season with Phil & Brian", "notes": "As summer wanes, air temperatures are starting to cool signifying the beginning of the fall season.  In my neck of the wood’s leaves are already starting to turn.  \r\n\r\nFor many fly fishers, such as myself and Brian Chan, these changes signify the beginning of the fall season, one of our favourite times of the year to be on the water.  \r\n\r\nJoin us as we discuss how lakes transition from summer to fall, gear, food sources, flies, and how our presentation and tactics evolve from the beginning of fall through until ice up.", "author": "Phil Rowley & Brian Chan", "url": "https://www.youtube.com/live/pid95BqAhwY?feature=share", "date_added": "2023-03-17", "snippet": "these changes signify the beginning of the fall season, one of our favourite times of the year to be on the water."}}, {"model": "catches.video", "pk": 88, "fields": {"name": "Catching LOADS Of trout in ALBERTA! | Mitchell pond Alberta", "notes": "in todays video I'm at a little pond in Red Deer Alberta catching TINY but MIGHTY stocker rainbow trout! \r\n\r\n\r\n\r\nGear used: Spoons & worms\r\n4 foot ultra light spinning rod with 6 lb mono", "author": "", "url": "https://youtu.be/j9GF_k78QxQ", "date_added": "2023-03-17", "snippet": "I'm at a little pond in Red Deer Alberta catching TINY but MIGHTY stocker rainbow trout!"}}, {"model": "catches.video", "pk": 89, "fields": {"name": "Chironomid Life Cycle", "notes": "http://flyguys.net : An exceptional under water video depicting the life stages, natural movements & emergence of the chironomid (larva, pupa & adult) by Klaus Peter Brodersen! Full Chironomid article here: http://flyguys.net/blog/aquatic-entom...", "author": "", "url": "https://youtu.be/RQwau_uSyy4", "date_added": "2023-03-17", "snippet": "An exceptional under water video depicting the life stages, natural movements & emergence of the chironomid (larva, pupa & adult)"}}, {"model": "catches.video", "pk": 90, "fields": {"name": "Top 5 Flies for stocked trout this Spring!", "notes": "", "author": "", "url": "https://youtu.be/hr5ZIqaynAw", "date_added": "2023-03-17", "snippet": "Here’s our suggestions for top flies for stocked trout this Spring.  Also a few tips as to why and how to use them."}}, {"model": "catches.video", "pk": 91, "fields": {"name": "Midges", "notes": "", "author": "", "url": "https://youtu.be/LaxpyMlTa88", "date_added": "2023-03-17", "snippet": "A detailed look at the life cycle of the Midge fly by Ralph & Lisa Cutter"}}, {"model": "catches.video", "pk": 92, "fields": {"name": "Reinforcing peacock herl", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/5F1QobMzgOA", "date_added": "2023-03-17", "snippet": "How to reinforce your peacock herl bodies using a dubbing loop.  Makes them almost bullet proof"}}, {"model": "catches.video", "pk": 93, "fields": {"name": "Fall Finale-Phil Rowley Fly Fishing", "notes": "Join me on the water as I managed to sneak out one last time this past fall just before ice up on one of my favorite local trout lakes.  \r\n\r\nThe water was in the high 30's and the lake was just coming out of fall turnover.  We had to work throughout the day using boatman, Blobs and micro leeches but we managed to find a few fish.\r\n\r\nDon't forget to check out mine and Brian Chan's Stillwater Fly Fishing App.  Our currently contains over 100 video tips including additional detail for some of the specific presentation techniques and tactics we used on this trip.   Once downloaded to your smartphone no Wi-Fi connection is needed to access the content.  It’s like having Brian and me on the water with you.\r\n\r\nCheck out the links below to what worked best, the equipment we used and to download and subscribe to the Stillwater Fly Fishing app.", "author": "Phil Rowley", "url": "https://youtu.be/DgDvuW244BM", "date_added": "2023-03-17", "snippet": "We had to work throughout the day using boatman, Blobs and micro leeches but we managed to find a few fish."}}, {"model": "catches.video", "pk": 94, "fields": {"name": "FLY FISHING: BABY DAMSELFLY NYMPHS", "notes": "Don and Brian Chan fly fish Morgan Lake near Kamloops, BC. Its mid April and the guys expected to use leeches and blobs but it turns out the fish were keyed on Baby Damsels and Mayfly Nymphs. Brent Schlenker ties his Ultimate Damselfly Nymph on the bench.", "author": "Brian Chan", "url": "https://youtu.be/Ikk8imk_ngM", "date_added": "2023-03-19", "snippet": ""}}, {"model": "catches.video", "pk": 95, "fields": {"name": "Figuring Out a Lake-Phil Rowley Fly Fishing Strategy", "notes": "Join me on the water as I get on the water early for one of my stillwater fly fishing schools at British Columbia's Corbett Lake Lodge.\r\n\r\nPrior to the start of any on-the-water stillwater fly fishing school, I like to experiment with different techniques, tactics, and flies appropriate to the season so I can pass along what I learned to my students so they can catch fish too.", "author": "Phil Rowley", "url": "https://youtu.be/32wanXPooY4", "date_added": "2023-03-19", "snippet": ""}}, {"model": "catches.video", "pk": 96, "fields": {"name": "Fly Tying & Fly Fishing How to fish the Washing Line and the flies to use.", "notes": "The Washing Line, many of you will already know this super effective way to catch fish. In this video I am going to tie a few of my favourite patterns for the tactic. I will also be talking through and explaining how and why I set up for fishing. I have time indexed the video for ease of use. \r\n\r\nPlease let me know what you think in the comments section below.\r\n\r\nTimecodes\r\n0:00.00 Intro\r\n0:01:15 Tying the Biscuit FAB\r\n0:08:00 Washing Line Leader measurements and explanation\r\n0:14:30 Red Spot Cruncher\r\n0:31:28 Diawl Bach (Variation)", "author": "", "url": "https://youtu.be/tbaNv0Tg7d8", "date_added": "2023-03-20", "snippet": "The Washing Line, many of you will already know this super effective way to catch fish. In this video I am going to tie a few of my favourite patterns for the tactic."}}, {"model": "catches.video", "pk": 97, "fields": {"name": "Ho wto tie a leader for indicator fishing", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/I993zgwqFlM?t=210", "date_added": "2023-03-20", "snippet": ""}}, {"model": "catches.video", "pk": 98, "fields": {"name": "Chironomids in Stillwaters, Kamloops Edition with Brian Chan", "notes": "Brian Chan, fisheries biologist and Stillwater Master, fishes the trout and bug rich lakes of the Kamloops region of B.C, just a half day’s drive from Missoula. He has honed his techniques and flies over decades to come up with a system of fishing midges that we can use on our own fertile lakes such as Georgetown and Browns. His presentation will explain the midge life cycle and outline the key fly fishing strategies to become consistently successful when fishing this prolonged aquatic insect hatch. Pattern selection, key larval and pupal presentation techniques will be shared with you to use wherever you find midges. Brian’s presentation will feature various macro images and video clips of the real larvae and pupae along with representative fly patterns and the latest materials being used to imitate these life stages. Best of all, Brian will conclude with a discussion of the fabulous stillwater fisheries found in the greater Kamloops area.", "author": "Brian Chan", "url": "https://youtu.be/zaosjj1bwjc", "date_added": "2023-03-20", "snippet": "Mast class on Chironomids"}}, {"model": "catches.video", "pk": 99, "fields": {"name": "5 Tips for Fly Fishing Big Lakes from Shore", "notes": "", "author": "Jordan Oelrich", "url": "https://youtu.be/BchXbZZ402s", "date_added": "2023-03-22", "snippet": "Fly fishing big lakes can be a daunting tasks, especially without a boat! Today's episode discusses 5 tips for fly fishing from shore on big waterbodies!"}}, {"model": "catches.video", "pk": 100, "fields": {"name": "Phil Rowley Long Leaders", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/1TProA8tNZE", "date_added": "2023-03-24", "snippet": "Phil demonstrates building long leaders and describes the knots and techniques.  Recorded at the annual January NLFT / TU Edmonton seminar."}}, {"model": "catches.video", "pk": 101, "fields": {"name": "PHIL ROWLEY LAKE FISHING ESSENTIALS", "notes": "Great video with lake fly fishing master Phil Rowley on the essentials needed for success. Tons of important information and how-to details for all levels of lake fishing for trout! For More Videos: https://goo.gl/F5CLCq\r\nSubscribe to Learn More About Fly Fishing: https://goo.gl/gQcSNw", "author": "Phil Rowley", "url": "https://youtu.be/bP72VZy1wWU", "date_added": "2023-03-24", "snippet": "Tons of important information and how-to details for all levels of lake fishing for trout!"}}, {"model": "catches.video", "pk": 102, "fields": {"name": "S3 E10 How To Fish Nymphs in a Lake Video", "notes": "In this episode of RIO's \"How To\" series, RIO brand manager Simon Gawesworth explains and demonstrates how to fish nymphs in a lake or stillwater. Simon runs through some key retrieves that all nymph anglers need to use, and explains what the best rigs to fish nymphs and chironomids (buzzers) are.", "author": "", "url": "https://youtu.be/HG4ox0UY-5M", "date_added": "2023-03-24", "snippet": "Every lake angler will find a time when fishing nymphs and chironomids is the very best way to catch fish, and this video is a perfect lesson for anyone wanting to increase their knowledge of this deadly style of fly fishing."}}, {"model": "catches.video", "pk": 103, "fields": {"name": "Lake Talk-Let's Talk Electronics", "notes": "Be sure to watch this Lake Talk Live event, Let's Talk Electronics for the Fly Fisher.  \r\n\r\nOne of the most common subjects I receive questions about when it comes to fly fishing lakes surrounds electronics, what to buy, what features to consider, and how to use them. Join me and Andrew Humphrey as we talk about electronics for the stillwater fly fisher.  As the western Canada sales rep for Humminbird, Andrew is fluent in sounders and their use.  \r\n\r\nJoin us as we discuss sounders, their features, use and set up.", "author": "Phil Rowley", "url": "https://www.youtube.com/live/5bUU_rsK1FA?feature=share", "date_added": "2023-03-27", "snippet": ""}}, {"model": "catches.video", "pk": 104, "fields": {"name": "How to Fish: Setting Up Your Fly Rod | GoFishBC", "notes": "In this video for beginner anglers, Brian Chan discusses the various fishing rod types and how to set up a rod with fishing line and tackle. Learn how to catch trout and other freshwater fish!\r\n\r\nFor more information on freshwater fishing in British Columbia, Canada, visit https://www.gofishbc.com\r\n\r\nFishing rods come in different sizes and fishing line varies in weight and strength. In this video, Brian Chan explains the rod and line options available to consumers and the different situations each is designed for. For typical lake fishing in B.C., an 8 - 9ft rod and 5 or 6 weight line is ideal. \r\n\r\nLearn how to put line on a rod, what a leader is and how to set it to the optimal depth for the fish you are targeting. Discover some of the essential knots (clinch knot and non-slip loop knot) and how to attach a weight, swivel and strike indicator to your fishing line. \r\n\r\nBoth floating and sinking line set-ups are covered in this video.", "author": "Brian Chan", "url": "https://youtu.be/i8JgtyUH1Hg", "date_added": "2023-03-27", "snippet": "Brian Chan discusses the various fishing rod types and how to set up a rod with fishing line and tackle."}}, {"model": "catches.video", "pk": 105, "fields": {"name": "Adventure #26 2021 | Fishing with special guests! | Len Thompson Pond Alberta", "notes": "This Sunday I am fishing with friends of the channel Mike G. and Carson M.! They easily outfished me, Mike landed 4 trout using his fly rod and Carson landed a nice rainbow on his fly rod as well! Thanks for coming out guys! Looks like a flyrod might be in my future!\r\n\r\nhttps://www.mydayoff.ca/\r\n\r\n-Mike G. caught 4 Trout (2 on camera) he caught both Rainbow and Tiger on his fly rod @ 1:58 and 3:00 of the video, Thanks Mike, I hope you enjoy the video!\r\n\r\n-Carson M. caught 1 nice Rainbow Trout on his flyrod as well! @ 8:22 of the video, Thank you Carson, I hope you had fun and enjoy the video!\r\n\r\n-My Day Off skunked!  I'm kinda used to it lol.", "author": "Matt (My Day Off)", "url": "https://youtu.be/y6eXttbupEY", "date_added": "2023-04-10", "snippet": "-Mike G. caught 4 Trout (2 on camera) he caught both Rainbow and Tiger on his fly rod @ 1:58 and 3:00 of the video, Thanks Mike, I hope you enjoy the video!"}}, {"model": "catches.video", "pk": 106, "fields": {"name": "Adventure #24 2022 | Mound Red Reservoir | Abraham Lake Submarine Deep Dive | 1st Fly Rod Trout", "notes": "Adventure #24 2022 | Mound Red Reservoir | Abraham Lake Submarine Deep Dive | 1st Fly Rod Trout", "author": "Matt (My Day Off)", "url": "https://youtu.be/TbH6EvXiqXQ", "date_added": "2023-04-10", "snippet": "Wow, what a weekend! Plans changed and dipped and dived. We were everywhere and ìn the end I was able to make a video lol. Thanks for watching everyone!!"}}, {"model": "catches.video", "pk": 107, "fields": {"name": "How to Fly Fish Chironomids in Lakes for Trout", "notes": "", "author": "", "url": "https://youtu.be/ye8UtVSijGM", "date_added": "2023-04-10", "snippet": "This can be a very effective technique for fishing with Chironomids with a strike indicator in a lake for trout."}}, {"model": "catches.video", "pk": 108, "fields": {"name": "Stillwater Retreives with Phil Rowley | How To", "notes": "", "author": "Phil Rowley", "url": "https://youtu.be/YGxmWh2l2T4", "date_added": "2023-04-10", "snippet": "New Fly Fisher host Phil Rowley discusses different retrieve options for stillwater fishing."}}, {"model": "catches.video", "pk": 109, "fields": {"name": "World Champion Fly-Fisher \"Jazz O'Driscoll\" Shows us his Advanced Stillwater Leader Set-up", "notes": "Jazz O'Driscoll is a Stillwater Fly-fisherman from Alberta, CANADA. He has over sixty years of experience fly fishing around the world. He pioneered many tactical forms of fishing such as the Chironomid fishing under an indicator. Helped develop the \"Slip Bodder Bobber\" And is twice champion of the World Fly-Fishing Tournament\r\n\r\nJazz is known for mentoring people like Phil Rowley, Brian Chan, and inspiring many others to get into the sport of Stillwater Fly fishing. He generously takes some time while in front of the beautiful \"Beaumont Pond\" and teach's us some of the advanced leader set-up techniques he uses for fishing Chironomids under an indicator", "author": "", "url": "https://youtu.be/UOxd5jt-jrI", "date_added": "2023-04-10", "snippet": "This is a joke video"}}, {"model": "catches.video", "pk": 110, "fields": {"name": "Chironomid Fly Fishing Basics", "notes": "Fly fishing chironomids on lakes can seem a little mysterious if you have never done it. This chironomid fly fishing video has broken down the basic tactics and ideas to help anyone just starting in lake fly fishing become a successful chironomid angler. \r\n\r\nIn the first segment of this chironomid fishing tactics video I cover the gear and flies needed to begin chironomid fishing. The second section I cover what types of water to fish with chironomids. In the final segment I show you some basic techniques for determining the depth of the water and the retrieval rate when fishing chironomids. \r\n\r\nThanks for watching and let me know if you have any questions!", "author": "", "url": "https://youtu.be/TRHl3i_Cq7E", "date_added": "2023-04-10", "snippet": ""}}, {"model": "catches.video", "pk": 111, "fields": {"name": "Midges Part 2, Fly Fishing Hatches XIII", "notes": "This video takes the flies that we've tied for midges and starts fishing midge hatches", "author": "", "url": "https://youtu.be/cn3b_H_UpT4", "date_added": "2023-04-11", "snippet": "Very good video about midge hatches."}}, {"model": "catches.video", "pk": 112, "fields": {"name": "Early Season Chironomid Tactics by Fly Fish Food", "notes": "A very good video", "author": "", "url": "https://youtu.be/tA4Z_SsB_bA", "date_added": "2023-04-12", "snippet": "A couple of tips for early season chironomid fishing with blood worms"}}, {"model": "catches.video", "pk": 113, "fields": {"name": "Why Are These Brook Trout So Picky? - Fly Fishing Travel Vlog", "notes": "In this fly fishing travel vlog, we took a trip up to a cool high elevation lake to chase some brook trout. These fish were some of the pickiest we have seen, Check out what flies and techniques did the trick!\r\n\r\nFlies Used In This Video:\r\n- Chironomid Frenchie: \r\nhttps://www.flyfishfood.com/blogs/sti...\r\n\r\n- Oil Slick Bugger:\r\nhttps://www.flyfishfood.com/blogs/sti...\r\n\r\n- Half-Whit Balanced Leech:\r\nhttps://www.flyfishfood.com/blogs/sti...\r\n\r\n- The Garbage Scud:\r\nhttps://www.flyfishfood.com/blogs/sti...\r\n\r\n- Pert-Near Pupa: \r\nhttps://www.flyfishfood.com/blogs/nym...", "author": "", "url": "https://youtu.be/QktLOgNIKF4", "date_added": "2023-04-12", "snippet": "In this fly fishing travel vlog, we took a trip up to a cool high elevation lake to chase some brook trout. These fish were some of the pickiest we have seen,"}}, {"model": "catches.video", "pk": 114, "fields": {"name": "How to Roll Cast — Fly Fishing For Beginners", "notes": "In today's Beginner Fly Fishing Masterclass video, we'll be covering how to roll cast a fly rod in 4 easy steps! The roll cast is very useful when you have limited back cast room or if you are fishing with heavy nymph rigs. The roll cast is a must-have fly cast to add to your fly fishing arsenal. So grab your fly rod, reel, fly line, leader... and let's get casting!", "author": "", "url": "https://youtu.be/LnrBUR_-iD0?si=ds9L5-QkL_9SkCri", "date_added": "2023-11-14", "snippet": ""}}, {"model": "catches.video", "pk": 115, "fields": {"name": "5 Fundamentals of Fly Tying Hooks", "notes": "If you're an avid fly tier or just starting out, you've probably come across what seems like thousands of fly tying hooks and wondered what the differences are. In this video, we'll be exploring the different types of fly tying hooks and their unique characteristics.\r\n\r\nWe'll cover the classic dry fly hook, known for its lightweight design and ability to float on the water's surface. Then, we'll move on to the versatile nymph hook, which is great for imitating aquatic insects that live under the water’s surface. Next up, we have the streamer hook, perfect for tying larger patterns that imitate larger baitfish and crayfish.\r\n\r\nBut wait, there's more! We'll also delve into jig hooks, which are gaining popularity for their unique design that allows the fly to ride hook point up, reducing snagging on the bottom.\r\n\r\nBy the end, you'll have a better understanding of the different types of fly tying hooks and which ones are best for your specific needs.", "author": "", "url": "https://youtu.be/rii-s9BUzvs?si=dbYSUmgvcLherSIO", "date_added": "2023-11-14", "snippet": ""}}, {"model": "catches.video", "pk": 116, "fields": {"name": "The ABCs of Fly Tying Thread", "notes": "In this video, we'll walk through the ABC's of fly tying thread. This comprehensive guide will cover everything from sizing systems, to structures, to material type, to colors, and how to use each! Our goal is to eliminate the confusion the next time you look at a spool of thread... polyester, nylon, denier, 6/0... No problem!\r\n\r\nThroughout the video, we'll go over helpful visuals and diagrams to make it easy to follow along. We'll also share recommendations for some of the best fly tying thread brands on the market and answer common questions.\r\n\r\nWhether you're a beginner or an experienced fly tier, this video is packed with valuable information and insights. So grab your tools and materials and join us for this deep dive into the world of fly tying thread!", "author": "", "url": "https://youtu.be/BLvNzFO5tWQ?si=2-P1yaQTCjijQzYf", "date_added": "2023-11-14", "snippet": ""}}, {"model": "catches.video", "pk": 117, "fields": {"name": "How to Successfully Fly Fish With Emergers", "notes": "", "author": "", "url": "https://youtu.be/uWzl4jNR5G8?si=m4PT6Podgz56QSSV&t=1668", "date_added": "2023-11-14", "snippet": ""}}, {"model": "catches.video", "pk": 118, "fields": {"name": "How to Setup for Pike Fly Fishing | Leaders, Flies, Flylines", "notes": "", "author": "", "url": "https://youtu.be/diEeUWR_CUE?si=BFmo8qYWywnWf4vN", "date_added": "2023-12-04", "snippet": "They're fly fishing for big pike and discuss the flies, fly lines and leaders needed for pike fishing."}}, {"model": "catches.video", "pk": 119, "fields": {"name": "Fly Tying Tips: Articulating Streamers", "notes": "", "author": "", "url": "https://youtu.be/vyJ3MtV1IBo?si=ryo1cmdEKmCypacJ", "date_added": "2023-12-12", "snippet": "Wire vs Mono vs Braid......all things articulating streamers."}}, {"model": "catches.video", "pk": 120, "fields": {"name": "How To Fly Fish An Intermediate Line In A Stillwater Lake", "notes": "In this episode of RIO's \"How To Fly Fish\" series, RIO brand manager Simon Gawesworth talks about fishing intermediate lines in a lake. The intermediate line should be the second line density every lake angler should buy (after a floating line), but few anglers know how to fish them, or the nuances behind using them.\r\n\r\nSimon explains what an intermediate line is, talks about when to use a clear versus a \"camo\" intermediate line, as well as discussing the sink rate that makes the line an \"intermediate\". In this video, packed with tips for the lake angler, Simon also shows how to fish the \"washing line\" and the \"hang\", and runs through a couple of excellent tips that, if you are new to fishing intermediate lines, will really help your day.\r\n\r\nClearly explained in Simon's easy-going, simple-to-understand style, this is an excellent film for anyone who fly fishes in lakes - packed with great information and tips.", "author": "Simon Gawesworth (Rio)", "url": "https://youtu.be/rI_-KFeB9s4?si=-pxu30FlQpPNC96z", "date_added": "2024-02-22", "snippet": "Simon Gawesworth talks about fishing intermediate lines in a lake."}}, {"model": "catches.video", "pk": 121, "fields": {"name": "The Catch Cast - Fly Fishing Tips and Tricks", "notes": "", "author": "Simon Gawesworth (Rio)", "url": "https://youtu.be/CGAeo-gVsHw?si=3J49sWKfwlYEkBea", "date_added": "2024-02-22", "snippet": "catch the fly in your hand so you can change it."}}, {"model": "catches.video", "pk": 122, "fields": {"name": "Easiest Way To Make A Loop Knot & Control The Size Of The Loop - Best Knot For Fishing", "notes": "Making Loop Knots is not easy for everyone, and making the loop small and controlling its size is definitely not easy.  This video will walk you though the easiest way to make a small loop knot for any fly or lure.  We use a large hook and fly line in the second half of the video, which will hopefully help people easily follow the steps.", "author": "", "url": "https://youtu.be/eu8m5U_sN_U?si=NNTHrV4_oEKq4uUz", "date_added": "2024-02-22", "snippet": "fast way to tie a loop know to the fly."}}, {"model": "catches.video", "pk": 123, "fields": {"name": "Fly clips", "notes": "RIO's fly clips are ultra-fast, easy connection clips that allow anglers to change flies with extreme ease and speed, and prevents leaders and tippet sections getting too short. Simply tie the appropriate sized clip on to the end of your leader and either twist or clip on your fly. Multiple sizes of clip ensure that there is a clip size suitable for the majority of fly sizes.", "author": "", "url": "https://youtu.be/qvrZVv9vQv0?si=p2WC7gNyjv50wuDe", "date_added": "2024-02-22", "snippet": "clips that allow anglers to change flies with extreme ease and speed"}}, {"model": "catches.video", "pk": 124, "fields": {"name": "The DOs & DON'Ts of Fishing Egg Patterns", "notes": "Untangled: Fly Fishing for Everyone is a question & answer based podcast where we answer questions submitted by listeners each week. Hosted by professional fly fishing guide and writer, Spencer Durrant. We'll bring you weekly tips to help all of us improve as fly anglers.  \r\n\r\nBe sure to listen to this week's episode. We cover:\r\n- What to know about fishing egg patterns\r\n- Is expensive fly line really worth it?\r\n- How do I know if I'm fishing too deep?", "author": "", "url": "https://youtu.be/eJlh4Ry6Q0U?si=Zbw0CgQ0gvpR2PC9", "date_added": "2024-02-22", "snippet": ""}}, {"model": "catches.video", "pk": 125, "fields": {"name": "The TRUTH about Fly Color", "notes": "- The truth about what colors fish do and don't see\r\n- How to tell flies apart (Dry vs Nymph vs Wet vs Streamer)\r\n- Fly rod length & weight\r\n- How to get started with new fishing techniques", "author": "", "url": "https://youtu.be/957O45wMO14?si=L0_SUq6_Jx5r14bC", "date_added": "2024-02-22", "snippet": ""}}, {"model": "catches.video", "pk": 126, "fields": {"name": "Brian Chans' Fly Fishing Secrets // Chironomids - Late Summer", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/LyXy_-cB9CI?si=f6n45UB1fokUhygJ", "date_added": "2024-02-22", "snippet": ""}}, {"model": "catches.video", "pk": 127, "fields": {"name": "Brian Chans' Fly Fishing Secrets // Chironomids - Early Spring", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/c6XFu_VdEGg?si=d94mFQQcWztNVYgE", "date_added": "2024-02-22", "snippet": "best video"}}, {"model": "catches.video", "pk": 128, "fields": {"name": "Shooting Your Fly Line Farther | Casting Instructor Pete Kutzer", "notes": "", "author": "", "url": "https://youtu.be/UZFJ30rhd0w?si=-qDMKTUbzxP1_XTn", "date_added": "2024-02-22", "snippet": "Pete Kutzer shows us how to improve our flyline casting and shooting the line farther."}}, {"model": "catches.video", "pk": 129, "fields": {"name": "Chironomid Fly Fishing Brookies and Bows", "notes": "Fly fishing for Brook Trout and Rainbow Trout with Hand Tied Chironomid Flies in the Kamloops British Columbia area.  \r\n\r\nLIVE CHIRONOMIDS!!!\r\n\r\nI absolutely love these little critters. I love when people post throat samples, seeing them for myself. It is an excellent resource to see what the bugs actually look like if you are planning on purchasing chironomids or tying them yourself.\r\n\r\nWhat exactly are you trying to emulate? Well this is exactly it.\r\n\r\nEven though you may be like me before I used them, questioning how a fish could even find a chironomid in the water column being a size 16 or less... but let me tell you they do.\r\n\r\nSeeing these chironomids will really help you understand how a simple single hook wrapped with some thread and wire can easily fool a fish. They look so similar.\r\n\r\nSimple deadly patterns.\r\n\r\nSeems the bulk hatches when I am fishing are either black, chrome or antistatic base with a chrome, black or copper looking rib. Some even look like a red rib.\r\n\r\nThere really are so many varieties, but these above color combos seem most prevalent.\r\n\r\nAnyways I hope this video helps the aspiring fly tiers and chironomid anglers to give it a try.  I had more action, but the camera didn't want to run all the time I guess.\r\n\r\nIf you have any comments or questions leave them below.\r\n\r\nThanks for watching and SUBSCRIBE if you're new to the channel and HIT the NOTIFICATION BELL.\r\n\r\nGod Bless your adventure and good luck fishing.", "author": "", "url": "https://youtu.be/uunqB7q2kik?si=oL7iNmhddy9Nx_au", "date_added": "2024-02-22", "snippet": "Fly fishing for Brook Trout and Rainbow Trout with Hand Tied Chironomid Flies"}}, {"model": "catches.video", "pk": 130, "fields": {"name": "How To Fish Nymphs in a Lake Video - RIO Products", "notes": "In this episode of RIO's \"How To\" series, RIO brand manager Simon Gawesworth explains and demonstrates how to fish nymphs in a lake or stillwater. Simon runs through some key retrieves that all nymph anglers need to use, and explains what the best rigs to fish nymphs and chironomids (buzzers) are.  \r\n\r\nEvery lake angler will find a time when fishing nymphs and chironomids is the very best way to catch fish, and this video is a perfect lesson for anyone wanting to increase their knowledge of this deadly style of fly fishing.", "author": "Simon Gawesworth (Rio)", "url": "https://youtu.be/ulAjFIPa_9k?si=MQ4m0xz1NWpAi0V4", "date_added": "2024-02-26", "snippet": "explains and demonstrates how to fish nymphs in a lake or stillwater."}}, {"model": "catches.video", "pk": 131, "fields": {"name": "FLY FISHING PREMIER SHOW: HOW TO USE CHIRONOMIDS SUCCESSFULLY", "notes": "", "author": "Brian Chan", "url": "https://youtu.be/88dJqGkrFPA?si=e7FhtjtB7w5FWwTf", "date_added": "2024-02-26", "snippet": "During this SFOTF Fly Fishing Premier Show, Don Freschi and Brian Chan show the viewers the correct setup and technique to use Chironomids successfully on a lake."}}, {"model": "catches.video", "pk": 133, "fields": {"name": "Top 3 Nymphing Methods to Catch More Fish (on a Basic Fly Rod)", "notes": "Modern nymph fishing has changed the game in how we fish rivers. But you can use some very effective methods with a classic rod and leader setup. Here I will show you what I believe are the 3 best methods. \r\n\r\nMy first rod setup used in this video:\r\nRod: Vision rivermaniac 9’ #5 medium \r\nReel: Vision XO #5-6 silver\r\nLine: Vision Feel 115 #5\r\n\r\nMy second rod setup used in this video:\r\nRod: Vision Sisu 9’ #5\r\nReel: Vision XO #5-6 black\r\nLine: Vision XO 100 #5", "author": "", "url": "https://youtu.be/jf2pc-NtfKk?si=vjg5Fx-LmLUvW5r7", "date_added": "2024-02-28", "snippet": "Modern nymph fishing has changed the game in how we fish rivers."}}, {"model": "catches.video", "pk": 134, "fields": {"name": "Teams of Nymphs For Stillwater Trout Fly Fishing", "notes": "", "author": "Rhys Fishes", "url": "https://youtu.be/Y2rVUwFSK7g?si=FXteU6coiS63MyU6", "date_added": "2024-02-28", "snippet": ""}}, {"model": "catches.video", "pk": 135, "fields": {"name": "10 Best Stillwater Flies (DON'T FISH LAKES WITHOUT THEM)", "notes": "In this video professional fly fishing guide and long-time angler Pierre shares with you the 10 best stillwater flies for lakes, reservoirs and ponds. Don't miss this video if you fish stillwater often.\r\n\r\nPierre covers the best stillwater flies that all fly fishers need in their fly box, as well as how to fish each one and some info on how to tie them. Plus we have videos on how to tie many of these separately.", "author": "", "url": "https://youtu.be/3qP5_YwrVy4?si=DwYn5BQ-CjISFf_W", "date_added": "2024-03-02", "snippet": "Pierre covers the best stillwater flies that all fly fishers need in their fly box, as well as how to fish each one and some info on how to tie them."}}, {"model": "catches.video", "pk": 136, "fields": {"name": "Trout Fishing: Brian Chan Explains the Life Cycle of a Chironomid", "notes": "This is a chapter from our Masterclass with renowned biologist and angler Brian Chan. Buy the full class here https://courses.anchoredoutdoors.com/...", "author": "Brian Chan", "url": "https://youtu.be/qJyQ-RPM1OI?si=r_8Tz90vyPfwcwyN", "date_added": "2024-03-02", "snippet": "In some fisheries, chironomids make up the majority of a trout's diet, making them some of the most important insects in the ecosystem."}}, {"model": "catches.video", "pk": 137, "fields": {"name": "Midges: Chapter 5 of the \"Bugs of the Underworld\" DVD", "notes": "Fly fishers, fly tiers, and anyone interested in aquatic insects. Near high definition quality in original format - YouTube compression makes it pretty fuzzy.", "author": "", "url": "https://youtu.be/NGQEPZqNZU8?si=jL-lGKuy_sNDduwH", "date_added": "2024-03-02", "snippet": "The life cycle of the midge filmed underwater."}}, {"model": "catches.video", "pk": 138, "fields": {"name": "Fly Fishing with a World Champion: Howard Croston on Small Stillwater Fishing", "notes": "In this video, Fulling Mill Signature Tyer Howard Croston walks us through his most used methods for small stillwater fly fishing. These are the three main tactics he employs if he doesn't know a small stillwater and wants to enjoy his day of fishing, or to get an idea of how it will fish. As he's often fishing completely new bodies of water in competitions, these are tactics that have proven themselves time and time again.\r\n\r\nThis video is broken into three parts: pulling lures, nymph fishing, and dry fly fishing. All three tactics have their time and place on small stillwaters, and Howard goes over when and why to use each. If you're a stillwater angler, or want to become one, you absolutely don't want to miss this #troutfishing #stillwater #lakefishing\r\n\r\n00:00 Introduction\r\n00:37 Howard's three most used stillwater methods\r\n01:28 Starting the day\r\n02:32 Howard's pulling setup\r\n03:04 Starting to fish: pulling lures\r\n04:51 Fishing the hang\r\n07:37 Playing a fish\r\n11:07 If it's not happening: Make it happen.\r\n14:12 Switching methods: fishing nymphs with a midge tip\r\n15:55 Howard's stillwater nymph setup\r\n17:03 Starting to nymph fish\r\n20:24 Indicator marks on your fly line\r\n21:14 A competition strategy\r\n23:39 Changing flies: fishing a light washing line\r\n24:13 Greasing your fly line\r\n29:26 How to play fish\r\n31:20 Changing methods: dry fly fishing\r\n32:55 Dry fly patterns\r\n33:48 Starting off on dries\r\n34:54 Dealing with drag\r\n37:53 Grease versus degrease on the line and leader\r\n40:48 How fish track in the water\r\n44:40 A change in conditions\r\n\r\nHoward Croston is a World Fly Fishing Champion (2019) and member of the English International Fly Fishing team. He’s also the Global Brand and Product Manager at Hardy. As one of our Signature Tyers Howard is constantly innovating new flies, and has many proven trout fly patterns in our collection. In this video you'll hear him discuss several of his flies that we carry, which are must-haves as the small stillwater season heats up", "author": "Howard Croston", "url": "https://youtu.be/2b9CSQ11zmE?si=O-N6bP5qVKtNqZYw", "date_added": "2024-03-02", "snippet": "walks us through his most used methods for small stillwater fly fishing"}}, {"model": "catches.video", "pk": 139, "fields": {"name": "Early Season Stillwater Tactics", "notes": "As with any portion of the trout season, it’s important to understand how lakes work so you can make educated assumptions as to where trout might be and why. Knowing this helps you put yourself in the right place and use the correct tactics and flies for the available food sources.\r\n\r\nJoin fellow stillwater addict, good friend, fisheries biologist, author, fly designer, business partner (Stillwater Fly Fishing Store) and TV Host with Sports Fishing on the Fly, Brian Chan and me as we discuss early season stillwater tactics.", "author": "Phil Rowley & Brian Chan", "url": "https://www.youtube.com/live/4emMhgy4C5g?si=n-q-sHvIMfUQK5f9", "date_added": "2024-03-08", "snippet": "it’s important to understand how lakes work so you can make educated assumptions"}}, {"model": "catches.video", "pk": 140, "fields": {"name": "HOW TO FLY FISH USING SHRIMP/SCUDS MASTER CLASS", "notes": "Brian Chan and Don Freschi discuss lifecycles, hatches, techniques, tips and tricks during this NEW Series of Videos for ALL Fly Anglers. The second in the Video Series is all about 'Shrimp/Scuds'. Please comment if you would like to see more of these Master Class Videos.", "author": "Brian Chan & Don Freschi", "url": "https://youtu.be/GmMU0HmGy4o?si=GF0SPXM3e0meqGwM", "date_added": "2024-03-18", "snippet": "discuss lifecycles, hatches, techniques, tips and tricks"}}, {"model": "catches.video", "pk": 141, "fields": {"name": "How to Pick the Right Fly For Any Fishing Situation | Ep. 29", "notes": "In this episode, Spencer Durrant sits down with Alex Stulce to give listeners a framework for how to pick the right fly for any fishing situation, even if you don't know anything about bugs. Dry flies, Nymphs, Streamers, Wet Flies... this information applies to every single kind of fly fishing fly. Whether you're a beginner to fly fishing, or if you've been around the block a few times, this episode is sure to have some valuable info to help you put more fish in the net.", "author": "Ventures Fly Co.", "url": "https://youtu.be/EVCa3iA-rhU?si=cMW9sC6utq5IHLsm", "date_added": "2024-03-23", "snippet": "how to pick the right fly for any fishing situation,"}}, {"model": "catches.video", "pk": 142, "fields": {"name": "Beginner's Guide to Fly Fishing: 6 Insider Tips for Success | Ep. 32", "notes": "", "author": "Ventures Fly Co.", "url": "https://youtu.be/QYRkmKtwQ2U?si=S3HhCzPRdg7409q-", "date_added": "2024-03-23", "snippet": ""}}, {"model": "catches.video", "pk": 143, "fields": {"name": "How to Successfully Fly Fish With Emergers | Ep. 46", "notes": "Untangled: Fly Fishing for Everyone is a question & answer based podcast where we answer questions submitted by listeners each week. In this episode, host Spencer Durrant teaches you everything you need to know about fly fishing with emergers. We'll also talk about:\r\n\r\n- Fly rods and fly lines for saltwater fly fishing\r\n- How to keep your flies from falling apart\r\n- How to find big fish in small rivers\r\n- How to pick the right dropper (aka nymph)", "author": "Ventures Fly Co.", "url": "https://youtu.be/uWzl4jNR5G8?si=ty3xfAuQWLSs1UK5", "date_added": "2024-03-23", "snippet": "Spencer Durrant teaches you everything you need to know about fly fishing with emergers"}}, {"model": "catches.video", "pk": 144, "fields": {"name": "How to Fly Fish With Nymphs: Our Secrets for Success | Ep. 47", "notes": "Untangled: Fly Fishing for Everyone is a question & answer based podcast where we answer questions submitted by listeners each week. In this episode, host Spencer Durrant is joined by Alex Stulce to talk about everything related to nymphing! You'll learn:\r\n\r\n- How to utilize various rigs (standard nymph rigs, euro rigs, the bounce rig, etc.)\r\n- Why nymphing is so effective\r\n- How to get your flies into the strike zone (aka the right depth)\r\n- How to tell if your nymphs are deep enough or too shallow\r\n- How to pick the right fly fishing fly\r\n- And much more!", "author": "Ventures Fly Co.", "url": "https://youtu.be/-ZD13OCjlmQ?si=4IfuDFndONGrVfzq", "date_added": "2024-03-23", "snippet": "talk about everything related to nymphing!"}}, {"model": "catches.video", "pk": 145, "fields": {"name": "How to Set Up a Nymph Rig — Fly Fishing for Beginners | Module 4, Section 4", "notes": "Nymphing is arguably the most productive way to fly fish. The majority of a trout's diet consists of bugs and other critters living below the water's surface. Using fly fishing flies that imitate these insects (and making sure you get those flies into the strike zone) is a good way to put lots of fish in the net. Today, we are going to walk you through how to set up the standard nymph rig step-by-step. You will need a leader, tippet, nymphs, split shot, and a strike indicator. Let's do this!", "author": "Ventures Fly Co.", "url": "https://youtu.be/V_OWrgwbztk?si=Fj2r1IorpW0mkm1f", "date_added": "2024-03-23", "snippet": "Nymphing is arguably the most productive way to fly fish."}}, {"model": "catches.video", "pk": 146, "fields": {"name": "Stillwater Fly Fishing: Checking Things Out - BCFLYGUYS Day Tripping S01E04", "notes": "In this episode of Day Tripping with the flyguys we're checking out a \"could be some big fish\" report with an intel mission to determine if a little local lake might have some trophy trout potential! This is a neat little lake for some fall stillwater fly fishing so armed with our proven fall fly patterns we set out to see what we could do! Check it out to see how we breakdown our search, what we find, and an in show tying session for the hot fly of the day!", "author": "BC Fly Guys", "url": "https://youtu.be/AtO7cKsFiKA?si=qkLdztgZvuvrKfeN", "date_added": "2024-03-23", "snippet": ""}}, {"model": "catches.video", "pk": 147, "fields": {"name": "How To Master Stillwater Retrieves for Fly Fishing - RIO Products", "notes": "This episode of RIO's \"How To\" series, is bought to you by RIO ambassador Phil Rowley. In this film Phil talks about the various retrieves that work well when fly fishing in a lake – breaking down the retrieves by length, speed, cadence and the pause between each pull. Phil talks about how to differ the retrieves according to fly style being fished – whether a bait fish pattern or a natural swimming insect.\r\n\r\nIf you enjoy fly fishing in lakes for trout but don’t have a high success rate, varying your retrieves will drastically change your success, and ensure you catch a lot more fish", "author": "Phil Rowley", "url": "https://youtu.be/EDVMbbh-3Oo?si=CdWui3Q7traK-eDw", "date_added": "2024-03-23", "snippet": "varying your retrieves will drastically change your success, and ensure you catch a lot more fish"}}, {"model": "catches.video", "pk": 148, "fields": {"name": "Fishing Abraham Lake in Alberta", "notes": "Knocking off one of my Bucket list fishing trips at Abraham Lake.", "author": "", "url": "https://youtu.be/LBPZLCujEXo?si=955Z6xX2z2S4YoDl", "date_added": "2024-04-05", "snippet": "Fishing For Lake Trout..."}}, {"model": "catches.video", "pk": 149, "fields": {"name": "Stillwater Fly Fishing made Simple for all year round Success. Simple, Fast, Effective.", "notes": "Methods and patterns we use during warmer months but have found effective during the colder months. Got to be the most enjoyable way to fish the fly with results. And even better, it's simple. Hope you enjoy the video. If you have not subscribed, then why not just click the subscribe button and hit the bell for all our content. Thanks. Shaun.\r\n\r\nLook for the fly at 3:06", "author": "", "url": "https://youtu.be/r6sAj2yxtS4?si=2R3qnn0OIeuvXC8T", "date_added": "2024-04-08", "snippet": "Not bad show about stillwater fishing."}}, {"model": "catches.video", "pk": 150, "fields": {"name": "Top 5 Flies and Tactics to start the 2024 Fishing Season (Stillwater Edition)", "notes": "This video is aimed at both experienced anglers as well as those just starting their fly fishing journey. Visiting large Stillwater can be very daunting in itself, then wondering what flies and tactics to use on such a huge expanse of water. This video will hope take some of that anxiety away. These five patterns have been proven winners over a number of years for early season Trout fishing. \r\n\r\nThe tactics are hopefully explained clearly for fly anglers of all abilities. Again these tactics have been proven over a number of years and have served me well. If you want to catch more trout give them a go. I am positive you won't be dissapointed. \r\nOrange blob - 1:35 - use it as the point on a washing line.  \r\nComerant - 4:52 - use with the blob on a washing line.\r\nBuzzer/Chironomid - 6:25 - \r\nBobby - \r\nCrunchers - 11:51 - later in the spring", "author": "", "url": "https://youtu.be/yxreWvpTMIU?si=l8xG9K0tCsXQxjca", "date_added": "2024-04-09", "snippet": "These five patterns have been proven winners over a number of years for early season Trout fishing."}}, {"model": "catches.video", "pk": 151, "fields": {"name": "Fish N Sticks | Early Ice Off Stillwater Fly Fishing Tactics (Sound Improved)", "notes": "https://flyguys.net | Tips & tactics for fly fishing pre hatch / pre turn stillwaters at ice off! Filmed in the Interior of beautiful British Columbia April 2021. \r\n\r\nGet your proven stillwater fly patterns here: https://www.customtroutflies.ca/", "author": "BCFlyguys", "url": "https://youtu.be/JF1vkPlcAgY?si=n9k_pTBD43akev1u", "date_added": "2024-04-10", "snippet": "Tips & tactics for fly fishing pre hatch / pre turn stillwaters at ice off!"}}]